app/Controllers/Productos.php

SELECT *
FROM `productos`
---
    public function index()
    {
        $data = [
            'title' => 'Gestión de Productos',
            'productos' => $this->productoModel->findAll(),

INSERT INTO `productos` (`codigo`, `nombre`, `descripcion`, `precio_compra`, `precio_venta`, `stock`, `categoria`) VALUES ('FA4L', 'Frasco 4 Litros En Vidrio Con Tapa Metálica Tipo Rosca', '', '15000', '20900', '10', 'Frascos')
---
    public function create()
    {
        // Validar los datos del formulario
        if (!$this->validate($this->productoModel->validationRules)) {
            return redirect()->back()->withInput()->with('errors', $this->validation->getErrors());
        }

        // Guardar el producto en la base de datos
        $this->productoModel->save([
            'codigo' => $this->request->getPost('codigo'),
            'nombre' => $this->request->getPost('nombre'),
            'descripcion' => $this->request->getPost('descripcion'),
            'precio_compra' => $this->request->getPost('precio_compra'),
            'precio_venta' => $this->request->getPost('precio_venta'),
            'stock' => $this->request->getPost('stock'),
            'categoria' => $this->request->getPost('categoria'),
        ]);