app/Controllers/Ventas.php

SELECT `ventas`.*, `clientes`.`nombre` as `cliente_nombre`, `clientes`.`apellido` as `cliente_apellido`, `canales_venta`.`nombre` as `canal_nombre`, `canales_venta`.`color` as `canal_color`
FROM `ventas`
JOIN `clientes` ON `clientes`.`id` = `ventas`.`cliente_id`
LEFT JOIN `canales_venta` ON `canales_venta`.`id` = `ventas`.`canal_venta_id`
ORDER BY `ventas`.`created_at` DESC
---
    public function index()
    {
        $data = [
            'title' => 'Gestión de Ventas',
            'ventas' => $this->ventaModel->select('ventas.*, clientes.nombre as cliente_nombre, clientes.apellido as cliente_apellido, canales_venta.nombre as canal_nombre, canales_venta.color as canal_color')
                ->join('clientes', 'clientes.id = ventas.cliente_id')
                ->join('canales_venta', 'canales_venta.id = ventas.canal_venta_id', 'left')
                ->orderBy('ventas.created_at', 'DESC')
                ->findAll()

SELECT *
FROM `canales_venta`
WHERE `activo` = 1
---
    public function new()
    {
        // Obtener canales de venta directamente
        $db = db_connect();
        $canalesVenta = [];

        // Intentar obtener los canales de la tabla canales_venta
        try {
            $canalesVenta = $db->table('canales_venta')
                ->where('activo', 1)
                ->get()->getResultArray();

SELECT *
FROM `clientes`
SELECT *
FROM `productos`
WHERE `stock` > 0
---

        $data = [
            'title' => 'Nueva Venta',
            'clientes' => $this->clienteModel->findAll(),
            'productos' => $this->productoModel->where('stock >', 0)->findAll(),

INSERT INTO `ventas` (`codigo`, `cliente_id`, `fecha`, `total`, `estado`, `estado_venta`, `comision`, `comision_fija`, `valor_envio`, `tipo_envio`, `tipo_publicacion`, `reteiva`, `wompi_comision`, `wompi_iva`, `factura_electronica`, `estado_pago`, `banco`, `notas`, `canal_venta_id`, `valor_real`) VALUES ('V-20250404-001', '2', '2025-01-02', '20900.00', 'completada', 'Entregado', '2926', '2500', '13700', 'A cargo del comprador', 'clásica', '829', 0, 0, 'FEV-136', 'Cancelado', 'Mercadopago', '', 2, 14645)
---
            log_message('debug', 'Datos de venta a insertar: ' . json_encode($ventaData));

            // Guardar venta directamente con el query builder
            $resultado = $this->db->table('ventas')->insert($ventaData);

INSERT INTO `detalles_venta` (`venta_id`, `producto_id`, `cantidad`, `precio_unitario`, `subtotal`) VALUES (11, '2', '1', '20900.00', '20900.00')
---
                    'subtotal' => $subtotales[$i]
                ];

                $resultadoDetalle = $this->db->table('detalles_venta')->insert($detalleData);

SELECT *
FROM `productos`
WHERE `id` = '2'
---
                }

                // Obtener producto actual
                $producto = $this->db->table('productos')
                    ->where('id', $productosIds[$i])
                    ->get()->getRowArray();