app/Models/VentaModel.php

    public function generarCodigo()
    {
        $fecha = date('Ymd');
        $ultimaVenta = $this->select('codigo')
            ->like('codigo', "V-$fecha")
            ->orderBy('id', 'DESC')
            ->first();
---
SELECT `codigo`
FROM `ventas`
WHERE `codigo` LIKE '%V-20250404%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 1